//
//  XMCalendarDataProvider.m
//  CalendarDemo
//
//  Created by xiaoming han on 15/4/1.
//  Copyright (c) 2015年 xiaoming.han. All rights reserved.
//

#import "XMCalendarDataProvider.h"

@implementation XMCalendarDataProvider

- (NSArray *)heavenlyStems
{
    return  @[@"甲", @"乙", @"丙", @"丁", @"戊", @"己", @"庚", @"辛", @"壬", @"癸"];
}

- (NSArray *)earthlyBranches
{
    return @[@"子", @"丑", @"寅", @"卯", @"辰", @"巳", @"午", @"未", @"申", @"酉", @"戌", @"亥"];
}

- (NSArray *)lunarZodiacs
{
    return @[@"鼠", @"牛", @"虎", @"兔", @"龙", @"蛇", @"马", @"羊", @"猴", @"鸡", @"狗", @"猪"];
}
- (NSArray *)solarTerms
{
    return @[@"小寒", @"大寒", @"立春", @"雨水",
             @"惊蛰", @"春分", @"清明", @"谷雨",
             @"立夏", @"小满", @"芒种", @"夏至",
             @"小暑", @"大暑", @"立秋", @"处暑",
             @"白露", @"秋分", @"寒露", @"霜降",
             @"立冬", @"小雪", @"大雪", @"冬至"];
}

- (NSArray *)lunarMonthItems
{
    return @[@"正", @"二", @"三", @"四", @"五", @"六", @"七", @"八", @"九",  @"十", @"冬", @"腊"];
}

- (NSArray *)lunarDayItems
{
    return @[@"初一", @"初二", @"初三", @"初四", @"初五", @"初六",
             @"初七", @"初八", @"初九", @"初十", @"十一", @"十二",
             @"十三", @"十四", @"十五", @"十六", @"十七", @"十八",
             @"十九", @"二十", @"廿一", @"廿二", @"廿三", @"廿四",
             @"廿五", @"廿六", @"廿七", @"廿八", @"廿九", @"三十"];
}

- (NSArray *)weekdaySymbols
{
    return @[@"日", @"一", @"二", @"三", @"四", @"五", @"六"];
}

- (NSDictionary *)lunarHolidays
{
    return @{@"1-1": @"春节",
             @"1-15": @"元宵节",
             @"5-5": @"端午节",
             @"7-7": @"七夕",
             @"7-15": @"中元节",
             @"8-15": @"中秋节",
             @"9-9": @"重阳节",
             @"12-8": @"腊八",
             @"12-29": @"除夕",
             @"12-30": @"除夕"};
}

- (NSDictionary *)solarHolidays
{
    return @{@"1-1": @"元旦",
             @"3-8": @"妇女节",
             @"4-1": @"愚人节",
             @"5-1": @"劳动节",
             @"6-1": @"儿童节",
             @"8-1": @"建军节",
             @"9-10": @"教师节",
             @"10-1": @"国庆节",
             @"12-25": @"圣诞节"};
}

@end
